Repository: LordKiRon/fb2epub
Catalog: RegisterFB2EPub/MainForm.*.resx
Languages: ru

# radioButtonChange.Text
source: Change/Repair
ru: Изменить/Исправить

# radioButtonChange.ToolTip
source: Change right click menu registrations or repir broken/not working registrations
ru: Изменить опции регистрации для контекстного меню правой клавиши мыши и/или отремонтировать неисправную/не работающую предыдущую регистрацию

# radioButtonRegister.Text
source: Register
ru: Зарегистрировать

# radioButtonRegister.ToolTip
source: Register file extensions for right click
ru: Зарегистрировать расширения для контекстного меню правой кнопки мыши

# label1.Text
source: Please select operation you wish to perform. "Register" will register shell extension that will allow you to convert FB2 files using mouse right click. "Unregister" will remove shell extension association from your system, disabling mouse right click functionality. "Change/Repair" will allow you to make changes to already performed registration or repair broken registration. Selecting "Custom" will take you to the advenced dialog, only for expirienced users.
ru: Пожалуйста выберете операцию которую вы хотели бы выполнить. "Зарегистрировать" зарегистрирует расширение оболочки которое позволяет конвертировать .FB2 файлы используя правую кнопку мыши. "Отменить_регистрацию" уберет привязку расширения оболочки к правой кнопке мыши на вашей системе. "Изменить/Исправить" позволит вам вносить изменения в настройки уже зарегистрированного расширения оболочки или поправить слетевшую регистрацию. "Дополнительно" включит диалог для опытных пользователей, где можно будет произвести дополнительные тонкие настройки. Только для опытных пользователей.

# radioButtonUnregister.Text
source: UnRegister
ru: Отменить регистрацию

# radioButtonUnregister.ToolTip
source: Remove right click registration
ru: Удалить регистрацию по правой кнопке мыши

# radioButtonCustom.Text
source: Custom(Advanced)
ru: Дополнительно

# radioButtonCustom.ToolTip
source: Advanced registration mode, use only if you know what you are doing.
ru: Режим для "продвинутых" пользователей, используйте только когда вы действительно знаете что делаете :)

# groupBox6.Text
source: FB2 shell registration control
ru: Настройки регистрации расширения FB2

# checkBoxAny.Text
source: Any extension
ru: Любой файл

# checkBoxAny.ToolTip
source: Check to allow any file extensions to be processed
ru: Отметьте чтобы разрешить обработку любых расширений файлов

# buttonUnSelectAll.Text
source: UnSelect all
ru: Очистить все

# buttonSelectAll.Text
source: Select all
ru: Выбрать все

# buttonSelectAll.ToolTip
source: Marks all checkboxes as checked
ru: Выбрать все опции сразу

# checkBoxRar.Text
source: .rar extension
ru: расширение .rar

# checkBoxRar.ToolTip
source: Check to show context menu on files with .RAR extension.
ru: Отметьте чтобы показывалось контекстное меню для файлов с расширением .RAR.

# checkBoxZip.Text
source: .zip extension
ru: расширение .zip

# checkBoxZip.ToolTip
source: Check to show context menu on files with .ZIP extension.
ru: Отметьте чтобы показывалось контекстное меню для файлов с расширением .ZIP.

# checkBoxFb2.Text
source: .fb2 extension
ru: расширение .fb2

# checkBoxFb2.ToolTip
source: Check to show context menu on files with .FB2 extension.
ru: Отметьте чтобы показывалось контекстное меню для файлов с расширением .FB2.

# groupBox2.Text
source: Extension registrations
ru: Регистрация расширений файлов

# dllPath.ToolTip
source: Path to shell extension DLL
ru: Путь к файлу расширения оболочки

# buttonBrowse.Text
source: Browse...
ru: Обзор...

# buttonBrowse.ToolTip
source: Browse to select location of shell extension DLL to register
ru: Указать расположение DLL расширения оболочки для его регистрации

# groupBox1.Text
source: Shell extension path
ru: Расположение файла расширения оболочки

# label2.Text
source: By pressing "Finish" button you will unregister Fb2ePub shell extension. Meaning the Fb2 to ePub conversion on the right mouse click will no longer be available on your computer. If that's what you want to do, go ahead and press "Finish". If you are got here by mistake or reconsidered - use "Back" button to return to previous wizard dialog.
ru: Нажав кнопку "Завершить" вы отмените регистрацию расширения оболочки Fb2ePub. Это означает что далее конвертация с Fb2 в ePub форматы при нажатии правой кнопки мыши больше не будет работать на вашем компьютере. Если это действительно то что вы хотите достичь - нажмите кнопку "Завершить". В противном случае, если вы попали сюда по ошибке или передумали - нажмите кнопку "Назад".

# groupBox5.Text
source: Unregistering Fb2 shell extension
ru: Отмена регистрации расширения .FB2

# labelRegPath.ToolTip
source: Path to registration DLL location
ru: Путь к регистрируемому DLL

# buttonRegBrowse.Text
source: Browse...
ru: Обзор...

# buttonRegBrowse.ToolTip
source: Browse to locate the file to register
ru: Указать файл для регистрации

# groupBox3.Text
source: Shell extension path
ru: Расположение файла расширения оболочки

# label4.Text
source: The program was unable to detect location of shell extension DLL to register. Please use "Browse" button bellow to navigate and select the location of the extension DLL. After locating it you will be able to continue by clicking on the "Next" button.
ru: Программа не смогла обнаружить расположение DLL файла расширения оболочки необходимого для регистрации. Пожалуйста используйте кнопку "Обзор" чтобы выбрать и указать программе расположение DLL расширения. После обнаружения этого файла вы сможете продолжить нажав на кнопку "Дальше".

# groupBox4.Text
source: Extension DLL location
ru: Расположение DLL расширения

# label3.Text
source: Choose if you wish conversion menu options to appear when you right click on any file with .FB2 extension
ru: Выберете зарегистрировать если вы желаете чтобы меню конвертора показывалось когда вы нажимаете на правую кнопку мыши на файлах с расширением .FB2

# radioButtonNotRegisterFb2.Text
source: Do not for register .FB2 extension
ru: Не регистрировать расширение .FB2

# radioButtonFb2Register.Text
source: Register for FB2 extension
ru: Зарегистрировать расширение .FB2

# groupBox7.Text
source: .FB2 extension registration
ru: Регистрация расширения файла .FB2

# checkBoxFb2ZipOnly.Text
source: Only .FB2.ZIP
ru: Только .FB2.ZIP

# checkBoxFb2ZipOnly.ToolTip
source: Process only files with .FB2.ZIP extension
ru: Обрабатывать только файлы с расширением .FB2.ZIP

# label5.Text
source: Choose if you wish conversion menu options to appear when you right click on any file with .ZIP extension
ru: Выберете заригестрировать если вы желаете чтобы меню конвертора показывалось когда вы нажимаете на правую кнопку мыши на файлах с расширением .ZIP

# radioButtonNotRegisterZip.Text
source: Do not for register .ZIP extension
ru: Не регистрировать расширение .ZIP

# radioButtonZipRegister.Text
source: Register for .ZIP extension
ru: Зарегистрировать расширение .ZIP

# groupBox8.Text
source: .ZIP extension registration
ru: Регистрация расширения файла .ZIP

# checkBoxFb2RarOnly.Text
source: Only .FB2.RAR
ru: Только .FB2.RAR

# checkBoxFb2RarOnly.ToolTip
source: Process only files with .FB2.RAR extension
ru: Обрабатывать только файлы с расширением .FB2.RAR

# label6.Text
source: Choose if you wish conversion menu options to appear when you right click on any file with .RAR extension
ru: Выберете зарегистрировать если вы желаете чтобы меню конвертора показывалось когда вы нажимаете на правую кнопку мыши на файлах с расширением .RAR

# radioButtonNotRegisterRar.Text
source: Do not for register .RAR extension
ru: Не регистрировать расширение .RAR

# radioButtonRarRegister.Text
source: Register for .RAR extension
ru: Зарегистрировать расширение .RAR

# groupBox9.Text
source: .RAR extension registration
ru: Регистрация расширения файла .RAR

# label7.Text
source: Please review the options you selected and if it's correct press "Finish" to perform registration. If you want to change something use "Back" button to return to the previos page you want to modify.
ru: Пожалийста проверьте все выбраные вами опции и настройки регистрации и если все верно - нажмите кнопку "Завершить". В противно случае, если вы хотите изменить что либо используйте кнопку "Назад" чтобы вернутся на предидущие страницы, которые вы хотели бы изменить.

# groupBox10.Text
source: Finishing the registration
ru: Окончание регистрации

# buttonPrev.Text
source: << Back
ru: << Назад

# buttonNext.Text
source: Next >>
ru: Дальше >>

# $this.Text
source: FB2EPUB shell extension registration utility wizard
ru: FB2EPUB регистратор расширения оболочки системы
