Repository: LordKiRon/fb2epub
Catalog: Fb2epubSettings/AppleV2Settings.*.resx
Languages: ru

# comboBoxOrientationLock.ToolTip
source: Select an orientation lock to prevent the book being displayed in speciffic orientation on device
ru: Выберите опцию запрещения ориентации, если хотите предотвратить отображение книги в определенной ориентации

# label3.Text
source: Orientation Lock:
ru: Блок. ориентации:

# checkBoxFixedLayout.Text
source: Fixed layout
ru: Фикс. макет

# checkBoxFixedLayout.ToolTip
source: Check to enable fixed layouy. Unadviced, used mostly for picture type books with manually created styles
ru: Выберите эту опцию если хотите получить фиксированный макет книги. Не рекомендуется использовать - только для книг с большим количеством картинок вместо текста и в ручную настроенными стилями позиционирования этих картинок на странице

# checkBoxSpreadToOpen.Text
source: SpreadToOpen
ru: Раскрыть при открытии

# checkBoxSpreadToOpen.ToolTip
source: Check to make the book open two pages on open
ru: Отметьте если хотите чтобы книга при открытии сразу открывалась на две страницы

# checkBoxUseCustomFonts.Text
source: Custom Fonts
ru: Встроенные фонты

# checkBoxUseCustomFonts.ToolTip
source: Check to enable Apple devices to use font embedded into ePub file
ru: Отметьте чтобы разрешить использование встроенных в ePub файл шрифтов на девайсах Apple

# groupBox4.Text
source: Settings
ru: Настройки

# buttonMoveLeft.ToolTip
source: Remove the platform from the list of used/configurated devices
ru: Удалить платформу из списка сконфигурированых

# buttonMoveRight.ToolTip
source: Add a platform to be used and configurated
ru: Использовать и конфигурировать выбранную платформу

# labelUsedPlatforms.Text
source: Used
ru: Используются :

# labelAvailablePlatforms.Text
source: Available :
ru: Доступные :

# listBoxAvailablePlatforms.ToolTip
source: List if available platfoms/ device types you can configurate
ru: Список платформ (девайсов) Вы можете сконфигурировать

# groupBox3.Text
source: Platforms
ru: Платформы

# listBoxUsedPlatforms.ToolTip
source: List of platforms / device types you selected to configurate
ru: Список платформ (девайсов) сконфигурированных на данный момент
