Repository: LordKiRon/fb2epub
Catalog: Fb2epubSettings/ConverterSettingsForm.*.resx
Languages: ru

# buttonSave.Text
source: Save
ru: Сохранить

# buttonSave.ToolTip
source: Save .config modifications
ru: Сохранить изменения настроек

# buttonReset.Text
source: Reset
ru: Сброс

# buttonReset.ToolTip
source: Drop changes and reset to initial state
ru: Отменить несохраненные изменения настроек

# buttonCancel.Text
source: Cancel
ru: Отмена

# buttonCancel.ToolTip
source: Exit without saving
ru: Закрыть без сохранения

# checkBoxTransliterateAdditional.Text
source: Transliterate additional data
ru: Транслитерировать дополнительную информацию

# checkBoxTransliterateAdditional.ToolTip
source: Transliterate additional information like book description (enable for readers without support of cyrillic fonts)
ru: Транслитерировать дополнительную информацию (такую как описание книги) Включать для ридеров не поддергивающих русские фонты

# checkBoxTransliterateFileName.Text
source: Transliterate file name
ru: Транслитерировать имя файла

# checkBoxTransliterateFileName.ToolTip
source: Transliterate file name (enable for readers that display file names in directory but do not have support for cyrillic fonts)
ru: Транслитерировать имя файла (включать для ридеров не поддерживающих русские фонты и показывающих имена файлов, а так же сортирующие по ним)

# checkBoxTransliterateTOC.Text
source: Transliterate Table of Content
ru: Транслитерировать оглавление

# checkBoxTransliterateTOC.ToolTip
source: Transliterate book's Table Of Content (enable for readers without support of cyrillic fonts)
ru: Транслитерировать оглавление (включать для ридеров не поддерживающих русские фонты)

# textBoxNoSeriesFormat.ToolTip
source: Format: %bt% - BookTitle from FB2 header Also following modifiers specified after '.' (dot) are allowed for %bt%, $sf% and %sa%: c - Capitalize, l - lowercase, u -UPPERCASE
ru: Формат: %bt% - Название книги из заголовка FB2 Так же возможно использовать следующие опции для %bt% (после точки): c - С заглавной буквы, l - все буквы маленькие, u -все буквы большие

# labelNoSeries.Text
source: No Series Format :
ru: Формат названия без серии :

# labelNoSeries.ToolTip
source: Format book title description info string , This allows to define what will be displayed on book description page if book is not part of series
ru: Формат в котором название книги будет показано на странице описания в случае если книга не принадлежит к серии

# checkBoxAddSequences.Text
source: AddSequences
ru: Добавлять серии

# checkBoxAddSequences.ToolTip
source: Enable/disable addition of abbreviated secuence names to the book title name
ru: Включает/выключает добавление сокращенных имен серий к имени книги

# textBoxNoSequenceFormat.ToolTip
source: Format: %bt% - BookTitle from FB2 header %sf% - Serie full name from FB2 header %sa% - Serie abbviarated name from FB2 header Also following modifiers specified after '.' (dot) are allowed for %bt%, $sf% and %sa%: c - Capitalize, l - lowercase, u -UPPERCASE
ru: Формат: %bt% - Название книги из заголовка FB2 %sf% - Полное название серии из заголовка FB2 %sa% - Сокращенное название серии из заголовка FB2 Также можно использовать следующие модификаторы для параметров %bt%, $sf% and %sa% (указанные после точки): c - С заглавной буквы, l - все маленькими буквами, u - все большими буквами

# labelNoSeqFormat.Text
source: NoSequenceFormat :
ru: Формат серии без номера :

# labelNoSeqFormat.ToolTip
source: Format book title description info string , This allows to define what will be displayed on book description page if book is part of series but does not have series number
ru: Формат в котором название серии будет добавлено к названию книги на странице описания в случае если книга не имеет номера в серии

# textBoxSequenceFormat.ToolTip
source: Format: %bt% - BookTitle from FB2 header %sf% - Serie full name from FB2 header %sa% - Serie abbviarated name from FB2 header %sn% - book number in the series Also following modifiers specified after '.' (dot) are allowed for %bt%, $sf% and %sa%: c - Capitalize, l - lowercase, u -UPPERCASE additionaly for parameter %sn% numeric modifier can be used to specify 0-preffix of the number
ru: Формат: %bt% - BookTitle (название) из заголовка FB2 %sf% - Полное название серии из заголовка FB2 %sa% - Сокращенное название серии из заголовка FB2 %sn% - номер книги в серии Также возможно использовать следующие опции для параметров %bt%, $sf% and %sa% , если указывать их через точку ('.'): c - С большой буквы , l - все буквы маленькие, u - все буквы большие Дополнительно, для параметра %sn% можно использовать цифровой модификатор чтобы задать 0 перед цифрой

# labelSeqFormat.Text
source: SequenceFormat :
ru: Формат серии с номером :

# labelSeqFormat.ToolTip
source: Format book title description info string, This allows to define what will be displayed on book description page
ru: Формат в котором название серии будет добавлено к названию книги на странице описания

# textBoxFileAsFormat.ToolTip
source: Format: %f% - First name from FB2 header %m% - Middle name from FB2 header %l% - last name from FB2 header %n% - Nick name from FB2 header Also following modifiers specified after '.' (dot) are allowed for %f%, %m%, %l% and %n%: c - Capitalize, l - lowercase, u -UPPERCASE additionally another subformat :b can be added to take name in brackets
ru: Формат: %f% - Имя автора из заголовка FB2 %m% - Отчество автора из заголовка FB2 %l% - Фамилия автора из заголовка FB2 %n% - Псевдоним автора из заголовка FB2 Так же можно использовать дополнительные опции (после точки) для параметров %f%, %m%, %l% and %n%: c - С Заглавной буквы, l - все буквы маленькие, u - все буквы большие Дополнительно еще один параметр :b может быть добавлен для отображения имени в скобках

# labelFileAsFormat.Text
source: FileAsFormat :
ru: Формат "FileAs" :

# labelFileAsFormat.ToolTip
source: Format "File As" author name , This allows to define what will be displayed on book description page
ru: Позволяет задать как имя автора будет выглядеть в "машинно читаемой" форме (FileAs).

# textBoxAuthorFormat.ToolTip
source: Format: %f% - First name from FB2 header %m% - Middle name from FB2 header %l% - last name from FB2 header %n% - Nick name from FB2 header Also following modifiers specified after '.' (dot) are allowed for %f%, %m%, %l% and %n%: c - Capitalize, l - lowercase, u -UPPERCASE additionally another subformat :b can be added to take name in brackets
ru: Формат: %f% - Имя автора из заголовка FB2 %m% - Отчество автора из заголовка FB2 %l% - Фамилия автора из заголовка FB2 %n% - Псевдоним автора из заголовка FB2 Так же можно использовать дополнительные опции (после точки) для параметров %f%, %m%, %l% and %n%: c - С Заглавной буквы, l - все буквы маленькие, u - все буквы большие Дополнительно еще один параметр :b может быть добавлен для отображения имени в скобках

# labelAuthorFormat.Text
source: AuthorFormat :
ru: Формат имени автора :

# labelAuthorFormat.ToolTip
source: Format author name , This allows to define what will be displayed on book description page
ru: Формат имени автора, позволяет задать как имя автора будет выглядеть в описании

# labelFixMode.Text
source: Fix mode :
ru: Режим коррекции FB2 :

# checkBoxSkipAboutPage.Text
source: Skip About page
ru: Не включать страницу описания

# checkBoxSkipAboutPage.ToolTip
source: If enabled will skip generation of ePub About page
ru: Если включено, то страница описания (About) не будет генерироваться

# checkBoxCapitalize.Text
source: Capitalize Drop
ru: Буквица

# checkBoxCapitalize.ToolTip
source: If enabled the first character of each chapter is displayed as capital drop
ru: Если включено, то первая буква каждой главы будет показана крупно (буквицей)

# checkBoxEmbedStyles.Text
source: Embed Styles
ru: Встроить стили

# checkBoxEmbedStyles.ToolTip
source: Invokes "embeding styles mode" that, instead of adding CCS files to the ePub and referencing them, in xHTML injects the relevant style code directly into the xHTML files (enable for some buggy readers)
ru: Включает режим при котором CSS стили "встраиваются" в xHTML файлы Данная опция предназначена для некоторых проблематичных ридеров.

# checkBoxFlatStructure.Text
source: Flat Structure
ru: "Плоская" структура

# checkBoxFlatStructure.ToolTip
source: Enable to make generated ePubs to have "flat structure" - do not have subfolders (required by some buggy readers, disable otherwise)
ru: Включает режим при котором конечные ePub файлы имеют "плоскую" внутреннюю структуру то есть не имеют поддиректорий внутри файла Необходимо только на некоторых некорректно работающих ридерах

# checkBoxConvertAlphaPNG.Text
source: Convert Alpha PNG
ru: Конвертировать PNG с прозрачностью

# checkBoxConvertAlphaPNG.ToolTip
source: Enable to convert all PNG files with Alpha channel to 32bit (some readers like Sony/ADE can not display PNG files with Alpha channel set)
ru: Включает конвертирование PNG файлов с прозрачностью в 32-х битные Увеличивает размер файла, но решает проблему для ридеров неспособных отображать PNG файлы с прозрачностью (вроде Sony, ADE и так далее)

# checkBoxFb2Info.Text
source: Include Fb2 info
ru: Добавлять FB2 информацию

# checkBoxFb2Info.ToolTip
source: Enable to add FB2 information data (file creator, software , etc) to the resulting ePub book
ru: Включает добавление в ePub дополнительной информации из заголовка FB2 (автор файла, использованные программы и т.д.)

# radioButtonSDEnabled.Text
source: Enabled
ru: Вкл.

# radioButtonSDDisabled.Text
source: Disabled
ru: Выкл.

# buttonEdit.Text
source: Edit...
ru: Изменить...

# buttonPathNew.Text
source: New...
ru: Добавить...

# buttonPathNew.ToolTip
source: Add new path
ru: Добавить новый путь

# checkBoxVisibleInGUI.ToolTip
source: Check to show path as converter GUI destination
ru: Поставьте галочку цчтобы путь был поклазан в списке фолдеров в графическом конвертере

# checkBoxVisibleInExt.Text
source: Extension
ru: Расшир.

# checkBoxVisibleInExt.ToolTip
source: Check to show path as shell extension destination target
ru: Поставьте галочку чтобы путь был показан в списке расширений , по правой кнопке

# buttonDownPath.Text
source: Move Down
ru: Вниз

# buttonDownPath.ToolTip
source: Move path down
ru: Передвинуть путь вниз

# buttonUpPath.Text
source: Move Up
ru: Вверх

# buttonUpPath.ToolTip
source: Move path up
ru: Передвинуть путь вверх

# buttonDeletePath.Text
source: Delete
ru: Удалить

# buttonDeletePath.ToolTip
source: Delete currently selected path from the list of paths
ru: Удалить выбраный путь из списка

# groupBox1.Text
source: Transliteration settings
ru: Настройки транслитерации

# tabPageTransliteration.Text
source: Transliteration
ru: Транслитерация

# tabPageTransliteration.ToolTipText
source: Transliteration related settings
ru: Настройки транслитерации (для ридеров не поддерживающих русские фонты)

# groupBoxSequences.Text
source: Sequences
ru: Серии

# tabPageSequences.Text
source: Sequences
ru: Форматирование данных

# tabPageSequences.ToolTipText
source: Sequence display related settings
ru: Настройки форматирования данных для отображения

# tabPageDifferent.Text
source: Options
ru: Опции

# tabPageDifferent.ToolTipText
source: Main options
ru: Основные настройки конвертера

# tabPageFonts.Text
source: Fonts
ru: Шрифты

# tabPageFonts.ToolTipText
source: Font related settings
ru: Настройки шрифтов

# groupBox2.Text
source: Single Destination
ru: Единственный путь

# tabPagePaths.Text
source: Paths
ru: Папки

# tabPagePaths.ToolTipText
source: Destination paths
ru: Папки вывода расширения

# $this.Text
source: ConverterSettings
ru: Настройки Конвертера
